title: VeilHunter - Credential File Created
id: fbb65e77-215b-4b90-bc31-0e11a45c9fc0
status: stable
description: Detects creation of files with names commonly associated with
  credential dumping tools such as Mimikatz output files.
author: jcube3ai
date: 2026-04-07
tags:
  - attack.credential_access
  - attack.t1003
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
      - 'lsass'
      - 'mimikatz'
      - 'credentials'
      - 'creds'
      - 'hashdump'
      - 'sam.save'
      - 'ntds.dit'
  condition: selection
falsepositives:
  - Security tooling in authorized red team exercises
level: high
