title: VeilHunter - Backup Service Disabled
id: 071c3ec7-cad3-451c-8db4-6ab5a534f228
status: stable
description: Detects attempts to disable or stop backup-related services,
  a common pre-ransomware technique to prevent recovery.
author: jcube3ai
date: 2026-04-07
tags:
  - attack.t1490
logsource:
  category: process_creation
  product: windows
detection:
  selection_sc:
    Image|endswith: '\sc.exe'
    CommandLine|contains:
      - 'stop'
      - 'delete'
      - 'disabled'
      - 'VSS'
      - 'swprv'
      - 'SDRSVC'
      - 'wbengine'
      - 'VeeamBackupSvc'
      - 'BackupExecAgentAccelerator'
  selection_net:
    Image|endswith: '\net.exe'
    CommandLine|contains:
      - 'stop'
      - 'VSS'
      - 'wbengine'
      - 'SDRSVC'
  condition: selection_sc or selection_net
falsepositives:
  - Legitimate maintenance scripts disabling backup services
level: high
